MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFR32MG13P832F512IM48/mcu.h
// #include "efr32mg13p_crypto.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_gpio_p.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_gpio.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_prs_ch.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_prs.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_ldma_ch.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EFR32MG13P832F512IM48_LDMA LDMA
 * @{
 * @brief EFR32MG13P832F512IM48_LDMA Register Declaration
 ******************************************************************************/
/** LDMA Register Declaration */
typedef struct {
  __IOM uint32_t  CTRL;          /**< DMA Control Register  */
  __IM uint32_t   STATUS;        /**< DMA Status Register  */
  __IOM uint32_t  SYNC;          /**< DMA Synchronization Trigger Register (Single-Cycle RMW)  */
  uint32_t        RESERVED0[5U]; /**< Reserved for future use **/
  __IOM uint32_t  CHEN;          /**< DMA Channel Enable Register (Single-Cycle RMW)  */
  __IM uint32_t   CHBUSY;        /**< DMA Channel Busy Register  */
  __IOM uint32_t  CHDONE;        /**< DMA Channel Linking Done Register (Single-Cycle RMW)  */
  __IOM uint32_t  DBGHALT;       /**< DMA Channel Debug Halt Register  */
  __IOM uint32_t  SWREQ;         /**< DMA Channel Software Transfer Request Register  */
  __IOM uint32_t  REQDIS;        /**< DMA Channel Request Disable Register  */
  __IM uint32_t   REQPEND;       /**< DMA Channel Requests Pending Register  */
  __IOM uint32_t  LINKLOAD;      /**< DMA Channel Link Load Register  */
  __IOM uint32_t  REQCLEAR;      /**< DMA Channel Request Clear Register  */
  uint32_t        RESERVED1[7U]; /**< Reserved for future use **/
  __IM uint32_t   IF;            /**< Interrupt Flag Register  */
  __IOM uint32_t  IFS;           /**< Interrupt Flag Set Register  */
  __IOM uint32_t  IFC;           /**< Interrupt Flag Clear Register  */
  __IOM uint32_t  IEN;           /**< Interrupt Enable Register  */

  uint32_t        RESERVED2[4U]; /**< Reserved registers */
  LDMA_CH_TypeDef CH[8U];        /**< DMA Channel Registers */
} LDMA_TypeDef;                  /** @} */

// #include "efr32mg13p_fpueh.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_gpcrc.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_timer_cc.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_timer.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_usart.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_leuart.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_letimer.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_cryotimer.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_pcnt.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_i2c.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_adc.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_acmp.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_vdac_opa.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_vdac.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_lesense_st.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_lesense_buf.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_lesense_ch.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_lesense.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_rtcc_cc.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_rtcc_ret.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_rtcc.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_rtc_comp.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_rtc.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_wdog_pch.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_wdog.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_etm.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EFR32MG13P832F512IM48_SMU SMU
 * @{
 * @brief EFR32MG13P832F512IM48_SMU Register Declaration
 ******************************************************************************/
/** SMU Register Declaration */
typedef struct {
  uint32_t       RESERVED0[3U];  /**< Reserved for future use **/
  __IM uint32_t  IF;             /**< Interrupt Flag Register  */
  __IOM uint32_t IFS;            /**< Interrupt Flag Set Register  */
  __IOM uint32_t IFC;            /**< Interrupt Flag Clear Register  */
  __IOM uint32_t IEN;            /**< Interrupt Enable Register  */

  uint32_t       RESERVED1[9U];  /**< Reserved for future use **/
  __IOM uint32_t PPUCTRL;        /**< PPU Control Register  */
  uint32_t       RESERVED2[3U];  /**< Reserved for future use **/
  __IOM uint32_t PPUPATD0;       /**< PPU Privilege Access Type Descriptor 0  */
  __IOM uint32_t PPUPATD1;       /**< PPU Privilege Access Type Descriptor 1  */

  uint32_t       RESERVED3[14U]; /**< Reserved for future use **/
  __IM uint32_t  PPUFS;          /**< PPU Fault Status  */
} SMU_TypeDef;                   /** @} */

// #include "efr32mg13p_trng.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_dma_descriptor.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_devinfo.h"  // Note: Changed for MikroE implementation.
// #include "efr32mg13p_romtable.h"  // Note: Changed for MikroE implementation.

/** @} End of group EFR32MG13P832F512IM48_Peripheral_TypeDefs  */

/***************************************************************************//**
 * @defgroup EFR32MG13P832F512IM48_Peripheral_Base Peripheral Memory Map
 * @{
 ******************************************************************************/

#define MSC_BASE          (0x400E0000UL) /**< MSC base address  */
#define EMU_BASE          (0x400E3000UL) /**< EMU base address  */
#define RMU_BASE          (0x400E5000UL) /**< RMU base address  */
#define CMU_BASE          (0x400E4000UL) /**< CMU base address  */
#define CRYPTO0_BASE      (0x400F0000UL) /**< CRYPTO0 base address  */
#define CRYPTO_BASE       CRYPTO0_BASE   /**< Alias for CRYPTO0 base address */
#define CRYPTO1_BASE      (0x400F0400UL) /**< CRYPTO1 base address  */
#define GPIO_BASE         (0x4000A000UL) /**< GPIO base address  */
#define PRS_BASE          (0x400E6000UL) /**< PRS base address  */
#define LDMA_BASE         (0x400E2000UL) /**< LDMA base address  */
#define FPUEH_BASE        (0x400E1000UL) /**< FPUEH base address  */
#define GPCRC_BASE        (0x4001C000UL) /**< GPCRC base address  */
#define TIMER0_BASE       (0x40018000UL) /**< TIMER0 base address  */
#define TIMER1_BASE       (0x40018400UL) /**< TIMER1 base address  */
#define WTIMER0_BASE      (0x4001A000UL) /**< WTIMER0 base address  */
#define USART0_BASE       (0x40010000UL) /**< USART0 base address  */
#define USART1_BASE       (0x40010400UL) /**< USART1 base address  */
#define USART2_BASE       (0x40010800UL) /**< USART2 base address  */
#define LEUART0_BASE      (0x4004A000UL) /**< LEUART0 base address  */
#define LETIMER0_BASE     (0x40046000UL) /**< LETIMER0 base address  */
#define CRYOTIMER_BASE    (0x4001E000UL) /**< CRYOTIMER base address  */
#define PCNT0_BASE        (0x4004E000UL) /**< PCNT0 base address  */
#define I2C0_BASE         (0x4000C000UL) /**< I2C0 base address  */
#define I2C1_BASE         (0x4000C400UL) /**< I2C1 base address  */
#define ADC0_BASE         (0x40002000UL) /**< ADC0 base address  */
#define ACMP0_BASE        (0x40000000UL) /**< ACMP0 base address  */
#define ACMP1_BASE        (0x40000400UL) /**< ACMP1 base address  */
#define VDAC0_BASE        (0x40008000UL) /**< VDAC0 base address  */
#define LESENSE_BASE      (0x40055000UL) /**< LESENSE base address  */
#define RTCC_BASE         (0x40042000UL) /**< RTCC base address  */
#define PRORTC_BASE       (0x40044000UL) /**< PRORTC base address  */
#define WDOG0_BASE        (0x40052000UL) /**< WDOG0 base address  */
#define WDOG1_BASE        (0x40052400UL) /**< WDOG1 base address  */
#define ETM_BASE          (0xE0041000UL) /**< ETM base address  */
#define SMU_BASE          (0x40022000UL) /**< SMU base address  */
#define TRNG0_BASE        (0x4001D000UL) /**< TRNG0 base address  */
#define DEVINFO_BASE      (0x0FE081B0UL) /**< DEVINFO base address */
#define ROMTABLE_BASE     (0xE00FFFD0UL) /**< ROMTABLE base address */
#define LOCKBITS_BASE     (0x0FE04000UL) /**< Lock-bits page base address */
#define USERDATA_BASE     (0x0FE00000UL) /**< User data page base address */

